In [2]:
phrase = "I'm Martin" #string
print(phrase)

I'm Martin

In [5]:
x = 5 #integer
y = 10
z = x + y #plus
print(z)
z = y / x #divide
print(z) #float

print(type(z))

15
2.0
<class 'float'>

In [8]:
favourite_colour = "teal"
colours_list = ['red', 'blue', 'green']
colours_list.append(favourite_colour)

print(f'My favourite colours are', colours_list)

more_colours = ['white', 'grey']
colours_list.extend(more_colours)
colours_list

My favourite colours are ['red', 'blue', 'green', 'teal']

['red', 'blue', 'green', 'teal', 'white', 'grey']

In [19]:
food_list = ['banana', 'apple', 'melon']
food_list
more_foods = ['strawberry', 'kiwi']
food_list.extend(more_foods)
food_list
#del food_list[1:3]
#print(food_list)

['banana', 'apple', 'melon', 'strawberry', 'kiwi']

In [18]:
numbers_list = [2,3,4,5,1,6]
numbers_list.sort()
print(numbers_list)
numbers_list.sort(reverse=True)
print(numbers_list)

numbers_list = [2,3,4,5,1,6]
sorted_numbers = sorted(numbers_list)
print(sorted_numbers)

[1, 2, 3, 4, 5, 6]
[6, 5, 4, 3, 2, 1]
[1, 2, 3, 4, 5, 6]

In [22]:
food_list
sorted_food = sorted(food_list)
print(sorted_food)
sorted_food_reverse = sorted(food_list,reverse=True)
print(sorted_food_reverse)

['apple', 'banana', 'kiwi', 'melon', 'strawberry']
['strawberry', 'melon', 'kiwi', 'banana', 'apple']

In [29]:
restaurant_dict = {'breakfast_bar' : ['croissant', 'banana', 'cereal'],
                   'lunch_cafe' : ['sandwich', 'baguette'],
                   'dinner_spot' : 'slap up meal'
                   }
print(restaurant_dict)
print(restaurant_dict['lunch_cafe'])
print(restaurant_dict.keys())
print(restaurant_dict.values())
print(restaurant_dict.items())

{'breakfast_bar': ['croissant', 'banana', 'cereal'], 'lunch_cafe': ['sandwich', 'baguette'], 'dinner_spot': 'slap up meal'}
['sandwich', 'baguette']
dict_keys(['breakfast_bar', 'lunch_cafe', 'dinner_spot'])
dict_values([['croissant', 'banana', 'cereal'], ['sandwich', 'baguette'], 'slap up meal'])
dict_items([('breakfast_bar', ['croissant', 'banana', 'cereal']), ('lunch_cafe', ['sandwich', 'baguette']), ('dinner_spot', 'slap up meal')])

In [5]:
python_group = {'Paul_D' : 'P&D Manager',
                'Martin' : 'SQL Developer',
                'Paul_M' : 'Performance Officer'
                }

python_group_list = list(python_group.keys())
print(python_group_list)

for key, val in python_group.items():
        print(f"My name is {key}, my job is {val}.")

['Paul_D', 'Martin', 'Paul_M']
My name is Paul_D, my job is P&D Manager.
My name is Martin, my job is SQL Developer.
My name is Paul_M, my job is Performance Officer.

In [2]:
import pandas as pd

dict_1 = {
    "column" : ["val 1", "val 2", "val 3"],
    "col 2" : [4, 5, 6],
    "col z" : ["foo", "bar", "baz"]
}

df_1 = pd.DataFrame(dict_1)
df_1

  column  col 2 col z
0  val 1      4   foo
1  val 2      5   bar
2  val 3      6   baz

In [19]:
list_of_dicts = [{
    'name' : 'Ilya Sorokin',
    'salary' : '9000000', #pass numbers as a string to convert later as example, otherwise should be a string
    'title' : 'Goaltender'
    }
    ,{
    'name' : 'Mathew Barzal',
    'salary' : '8500000',
    'title' : 'Winger'
    }
    ,{
    'name' : 'Bo Horvat',
    'salary' : '8500000',
    'title' : 'Centre'
    }
    ,{
    'name' : 'Noah Dobson',
    'salary' : '4000000',
    'title' : 'Defenseman'
    }]

df_2 = pd.DataFrame(list_of_dicts) 
df_2
#python range starts at 0, not 1

            name   salary       title
0   Ilya Sorokin  9000000  Goaltender
1  Mathew Barzal  8500000      Winger
2      Bo Horvat  8500000      Centre
3    Noah Dobson  4000000  Defenseman

In [20]:
print(df_2.info())
print(df_2.dtypes)
print(df_2.head(1)) #parameter defaults to top 20 records unless specified.
print(df_2.tail(1)) #returns last records

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    4 non-null      object
 1   salary  4 non-null      int64
 2   title   4 non-null      object
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes
None
name      object
salary     int64
title     object
dtype: object
           name   salary       title
0  Ilya Sorokin  9000000  Goaltender
          name   salary       title
3  Noah Dobson  4000000  Defenseman

In [23]:
df_2['salary'] = df_2['salary'].astype('int')
df_2.dtypes
df_2.info()
df_2

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    4 non-null      object
 1   salary  4 non-null      int64
 2   title   4 non-null      object
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

            name   salary       title
0   Ilya Sorokin  9000000  Goaltender
1  Mathew Barzal  8500000      Winger
2      Bo Horvat  8500000      Centre
3    Noah Dobson  4000000  Defenseman

In [30]:
print(df_2['salary'].sum())
df_2_salary_total = df_2['salary'].sum()
df_2_salary_running_total = df_2['salary'].cumsum() #cumulative sum
df_2_salary_mean = df_2['salary'].mean()
df_2_salary_min_max = f"Salary minimum: {df_2['salary'].min()}, salary maximum: {df_2['salary'].max()}"
print(df_2_salary_total)
print(df_2_salary_running_total)
print(df_2_salary_mean)
print(df_2_salary_min_max)

30000000
30000000
0     9000000
1    17500000
2    26000000
3    30000000
Name: salary, dtype: int64
7500000.0
Salary minimum: 4000000, salary maximum: 9000000

In [31]:
inflation = 1.067 #pay raise of 6.7%
df_2['salary'] = df_2['salary'] * inflation
df_2

            name     salary       title
0   Ilya Sorokin  9603000.0  Goaltender
1  Mathew Barzal  9069500.0      Winger
2      Bo Horvat  9069500.0      Centre
3    Noah Dobson  4268000.0  Defenseman

In [38]:
df_2['date_of_birth'] = ['05-08-1995', '26-05-1997', '05-04-1995', '07-01-2000']
df_2

df_2['date_of_birth'] = datetime.strptime(df_2['date_of_birth'], format='%d/%m/%Y')
# df_2

NameError: name 'datetime' is not defined